Repository: pypi-data/pypi-mirror-129
Catalog: packages/crowdlaw/crowdlaw-1.0.0-py3-none-any.whl/crowdlaw/locale/*/LC_MESSAGES/crowdlaw.po
Languages: pl_pl

source: On boarding
pl_pl: Inicjalizacja

source: Unsupported API provided: {api}
pl_pl: Nieobsługiwany interfejs API: {api}

source: Update token info
pl_pl: Zaktualizuj ustawienia tokena

source: Couldn't authenticate with current token info
pl_pl: Nie udało się zalogować, używając danych tokena

source: Close
pl_pl: Zamknij

source: At least one stage should be marked as active
pl_pl: Jeden etap powinien by aktywny

source: Provide name for every stage
pl_pl: Podaj nazwę dla każdego etapu

source: Are you sure you want to update token info?
pl_pl: Czy na pewno chcec zaktualizować dane tokena ?

source: Updating token info, will update it for all projects
pl_pl: Aktualizacja danych tokena, zaktualizuje go dla wszystkich projektów

source: which use {git_provider}
pl_pl: które używają {git_provider}

source: Are you sure?
pl_pl: Czy jesteś pewien?

source: Add new project
pl_pl: Dodaj nowy projekt

source: Are you sure you want to remove project?
pl_pl: Czy jesteś pewien, że chcesz usunąć project?

source: WARNING: This will remove all project files from your local computer
pl_pl: UWAGA: Zamierzasz usunąć wszystkie pliki projektu z Twojego komputera

source: associated with project {project_name}.
pl_pl: związane z projektem {project_name}.

source: Copy will be left on the server
pl_pl: Kopia pozostanie na serwerze

source: To remove server version go to {server_url}
pl_pl: By usunąć wersję z serwera, otwórz {server_url}

source: Are you sure you want ro remove files from local computer?
pl_pl: Czy jesteś pewien, że chcesz usunąć pliki lokalne?

source: Confirm file deletion
pl_pl: Potwierdź usunięcie pliku

source: Are you sure you want to remove file {file} ?
pl_pl: Czy jesteś pewien, że chcesz usunąć {file} ?

source: Are you sure you want to remove current set?
pl_pl: Czy jesteś pewien że chcesz usunąć aktulalny zestaw zmian?

source: All changes made in this set will be lost locally.
pl_pl: Wszystkie zmiany w tym zestawie zmian, zostaną utracone z tego komputera.

source: They will be still available on the server, if you sent them
pl_pl: Jeśli wysłałeś je na serwer, wciąż tam będą dostępne

source: Are you sure you want to remove current set locally?
pl_pl: Czy jesteś pewien, że chcesz usunąc lokalny zestaw zmian?

source: On Boarding
pl_pl: Inicjalizacja

source: Provide Git account details
pl_pl: Podaj dane konta Git

source: Clicking 'Obtain token' will take you to the git page. Fill fields as on picture
pl_pl: Kliknięcie "Uzyskaj token" otworzy stronę Git. Wypełnij wszystkie pola, jak na obrazku.

source: Provide new file name
pl_pl: Podaj nazwę nowego pliku

source: New filename
pl_pl: Nowy plik

source: Filename cannot be empty
pl_pl: Nazwa pliku nie może być pusta

source: Warning: Unsaved changes
pl_pl: Uwaga: Niezapisane zmiany

source: You have unsaved changes in editor. Do you want to save them before proceeding?
pl_pl: W edytorze masz niezapisane zmiany. Czy chcesz je zapisać, nim będziesz kontynuował?

source: All your changes to the articles, will be treated together as one set Please, give a short name to a new set of changes
pl_pl: Wszystkie Twoje zmiany do dokumentów, będą traktowane razem jako zestaw zmian Proszę, podaj krótką nazwę dla tego zestawu zmian

source: Provide name for your set of changes
pl_pl: Podaj nazwę dla Twojego zestawu zmian

source: Working set with name {branch_name} already exists
pl_pl: Zestaw zmian o nazwie {branch_name} już istnieje

source: Provide title for your proposed changes
pl_pl: Podaj tytuł proponowanych zmian

source: No changes to send. Edit some files first.
pl_pl: Brak zmian do wysłania. Zmień troche plików wpierw

source: Updates to review
pl_pl: Poprawki do recenzji

source: Please select if you want to create new or join existing project
pl_pl: Proszę, wybierz czy chcesz stworzyć nowy project, czy dołączyć do istniejącego

source: Provide project name
pl_pl: Podaj nazwę projektu

source: Provide project web address
pl_pl: Podaj adres internetowy projektu

source: Provided unsupported Git provider
pl_pl: Podany adres internetowy jest niewspierany

source: Provide valid web address of a project
pl_pl: Podaj prawidłowy adres internetowy projektu

source: Provide username
pl_pl: Podaj nazwę użytkownika

source: Provide API token key
pl_pl: Podaj klucz API tokena

source: Provide API token key name
pl_pl: Podaj nazwę klucza API tokena

source: I was not able to authenticate using credentials provided
pl_pl: Nie udało mi się zalogować podanym tokenem

source: Project {project_name} already exists
pl_pl: Projekt {project_name} już istnieje

source: Project folder {project_dir} already exists
pl_pl: Folder projektu {project_dir} już istnieje

source: There was an error while creating copy of the project on your server. Probably project {project_name} already exists on your server.
pl_pl: Wystąpił błąd podczas tworzenia kopii na Twoim serwerze. Prawdopodobnie projekt {project_name} znajduje się na Twoim serwerze.

source: Contents of {example_file}
pl_pl: Zawartość przykładowa pliku {example_file}

source: Initial commit for project {project_name}
pl_pl: Wstępny commit projektu {project_name}

source: Found some issues, please correct them.
pl_pl: Zostały znalezione błędy. Proszę, napraw je.

source: Help
pl_pl: Pomoc

source: Yes
pl_pl: Tak

source: No
pl_pl: Nie

source: Cancel
pl_pl: Anuluj

source: Select app language
pl_pl: Wybierz język aplikacji

source: Switch language
pl_pl: Zmień język

source: Change app language
pl_pl: Zmień język aplikacji

source: &Settings
pl_pl: &Ustawienia

source: &Change language
pl_pl: &Zmień język

source: &Help
pl_pl: &Pomoc

source: &About
pl_pl: &O programie

source: Info
pl_pl: Informacja

source: [edit contact info]
pl_pl: [edytuj dane kontaktowe]

source: [add contact info]
pl_pl: [dodaj dane kontaktowe]

source: Contact info
pl_pl: Dane kontaktowe

source: contact info not set by maintainer
pl_pl: dane kontaktowe nie ustawione

source: Information about group contact provided by maintainer
pl_pl: Dane kontaktowe ustawione przez prowadzącego projekt

source: Server info
pl_pl: Dane serwera

source: [share url]
pl_pl: [udostępnij adres]

source: copied to clipboard
pl_pl: skopiowano do schowka

source: User: {user}
pl_pl: Użytkownik: {user}

source: Token name: {token_name}
pl_pl: Nazwa tokena: {token_name}

source: Project info
pl_pl: Dane projektu

source: Current project
pl_pl: Obecny projekt

source: [change project]
pl_pl: [zmień projekt]

source: This is your main project, where you collaborate with other people. Project is kept on server, but can be edited locally. When you will create your version, you will upload your changes to the server for a review by other team members.
pl_pl: Jeden projekt może być tworzony przez wielu ludzi. Projekt jest przetrzymywany na zdalnym serwerze, ale może być edytowany na Twoim komputerze. Gdy będzie gotowy, wyślij swój pakiet zmian na serwer, by inni członkowie zespołu mogli się z nim zapoznać

source: Documents in the set
pl_pl: Dokumenty w zestawie

source: Click document to start editing
pl_pl: Kliknij document, by rozpocząć edycję

source: Add new file
pl_pl: Dodaj nowy plik

source: Remove selected file
pl_pl: Usuń zaznaczony plik

source: This shows what is actual status of your project.
pl_pl: To pokazuje aktualny etap projektu

source: Unrecognized status of stage
pl_pl: Nierozpoznany status etapu

source: [edit stage info]
pl_pl: [edytuj etapy]

source: Project stage
pl_pl: Etap projektu

source: Document editor
pl_pl: Edytor dokumentu

source: Save
pl_pl: Zapisz

source: Sets of changes
pl_pl: Zestawy zmian

source: In one project you can prepare multiple versions of proposed changes. Each version is called set of changes (or branch). You can work on different sets of changes in parallel.
pl_pl: W jednym projekcie, możesz przygotować wiele wersji proponowanych zmian. Każda wersja zmian, jest nazywana zestawem zmian (branch). Możesz równolegle pracować nad różnymi zestawami zmian.

source: Add new set
pl_pl: Dodaj nowy zestaw

source: Remove set
pl_pl: Usuń zestaw

source: When you are ready to propose your changes, send them for a review. Other team members will review them. All reviews are done on remote server. Communication is done by email, so watch your inbox.
pl_pl: Kiedy skończysz przygotowywać zestaw zmian, wyślij je do akceptacji. Inni członkowie zespołu przejrzą je. Wszystkie przejrzenia robi się na serwerze. Komunikacja odbywa się poprzez email.

source: Send working set for a review
pl_pl: Wyślij zestaw do recenzji

source: Update current review
pl_pl: Zaktualizuj wersję do recenzji

source: Working in demo version. You cannot upload your changes
pl_pl: Praca na wersji demo. Nie możesz wysyłać zmian.

source: Reviews
pl_pl: Recenzje

source: Change project
pl_pl: Zmień projekt

source: Remove project
pl_pl: Usuń projekt

source: Add / edit contact info
pl_pl: Dodaj / edytuj dane kontaktowe

source: Provide contact info (Whatsapp group, FB group, mailing list, etc), where all participants can communicate with each other
pl_pl: Podaj dane kontaktowe dla grupy (grupa WhatsApp, Facebook, grupa mejlowa, itp.) gdzie wszyscy członkowie mogą się nawzajem komunikować.

source: Active stage
pl_pl: Aktywny etap

source: Stage name
pl_pl: Nazwa etapu

source: Remove stage
pl_pl: Usuń etap

source: Edit stage info
pl_pl: Edytuj etapy

source: Add stage
pl_pl: Dodaj etap

source: Mark all as done
pl_pl: Zaznacz wszystkie jako wykonane

source: Before you start writing Law, we need few answers.
pl_pl: Nim ropoczniesz pisanie prawa, potrzebujemy kilka odpowiedzi

source: What do you want to do?
pl_pl: Co chcesz zrobić?

source: Create fresh empty project, which others can join
pl_pl: Stwórz nowy, pusty projekt, do którego inni dołączą

source: Join existing project
pl_pl: Dołącz do istniejącego projektu

source: Launch demo version
pl_pl: Otwórz wersję demo

source: Join demo project to preview application
pl_pl: Podgląd aplikacji w wersji demo

source: Provide new project name
pl_pl: Podaj nazwę nowego projektu

source: Provide web address of existing project
pl_pl: Podaj adres internetowy istniejącego projektu

source: example: https://gitlab.com/gladykov/example-project-for-crowd-law
pl_pl: przykład: https://gitlab.com/gladykov/example-project-for-crowd-law

source: Next
pl_pl: Dalej

source: Welcome to Crowd Law app
pl_pl: Witamy w aplikacji Crowd Law

source: In order to work with this tool, you will need account on Git site. It will take you only a moment.
pl_pl: By pracować z tą aplikacją, potrzebujesz konta Git. Zajmie to tylko chwilę

source: Select Git site
pl_pl: Wybierz stronę Git

source: Provide {git} username
pl_pl: Podaj nazwę użytkownika {git}

source: No account? Create now.
pl_pl: Nie masz konta? Utwórz teraz

source: Provide {git_provider} token
pl_pl: Podaj token {git_provider}

source: Obtain token
pl_pl: Uzyskaj token

source: Provide token name
pl_pl: Podaj nazwę tokena

source: Back
pl_pl: Wróć

source: Git details
pl_pl: Dane Git
