Repository: pypi-data/pypi-mirror-129
Catalog: packages/spoken-time/spoken_time-0.1.0-py2.py3-none-any.whl/spoken_time/locale/*/LC_MESSAGES/spoken_time.po
Languages: de

source: It is {time}.
de: Es ist {time}.

source: Today is {date}.
de: Heute ist {date}.

source: one minute
de: eine Minute

source: one o'clock
de: ein Uhr

source: noon
de: Mittag

source: midnight
de: Mitternacht

source: quarter past {num_hour} {am_pm}
de: viertel nach {num_hour} {am_pm}

source: half past {num_hour} {am_pm}
de: halb {next_num_hour} {am_pm}

source: quarter to {next_num_hour} {am_pm}
de: viertel vor {next_num_hour} {am_pm}

source: {to_minutes} to {next_num_hour} {am_pm}
de: {to_minutes} vor {next_num_hour} {am_pm}

source: {minutes} past {hour} {am_pm}
de: {hour} und {minutes} {am_pm}

source: at night
de: nachts

source: in the morning
de: morgens

source: before noon
de: vormittags

source: around noon
de: mittags

source: in the afternoon
de: nachmittags

source: in the evening
de: abends

source: {weekday}, the {day} of {month} {year}
de: {weekday}, der {day} {month} {year}

source: day before yesterday
de: vorgestern

source: yesterday
de: gestern

source: today
de: heute

source: tomorrow
de: morgen

source: the day after tomorrow
de: übermorgen

source: {preposition} last {weekday}
de: {preposition} letzten {weekday}

source: {preposition} next {weekday}
de: {preposition} kommenden {weekday}
