{"do_lower_case": false, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": null, "model_max_length": 512, "special_tokens_map_file": "/home/terry/.cache/huggingface/transformers/7dd37b544a6a1e3413e36ada23bcfffaccfbad488cda1791f6d43043986e3fb5.dd8bd9bfd3664b530ea4e645105f557769387b3da9f79bdb55ed556bdd80611d", "name_or_path": "uer/chinese_roberta_L-2_H-512", "do_basic_tokenize": true, "never_split": null, "tokenizer_class": "BertTokenizer"}